"""
小练习
"""

# age = [21,25,21,23,22,20]

# 1. 定义这个列表，并用变量接收他
age = [21, 25, 21, 23, 22, 20]

# 2. 追加一个数字31，到列表的尾部
age.append(31)
print(f"在列表尾部追加一个元素31后，{age}")

# 3. 追加一个新列表[29,33,30],到列表的尾部
age1 = [29, 33, 30]
age.extend(age1)
print(f"在列表尾部追加一个新列表后：{age}")

# 4. 取出第一个元素（应是：21）
element = age.pop(0)
print(f"取出第一个元素后：{age},取出的元素是：{element}")

# 5. 取出最后一个元素（应是：30）
element_1 = age.pop(-1)
print(f"取出最后一个元素后：{age},取出的元素是：{element_1}")

# 6. 查找元素31，在列表中的下标位置
index = age.index(31)
print(f"元素31在列表中的位置是{index}")
print(f"最后列表中的内容是：{age}")