"""
升职加薪小练习
"""

# 定义一个字典
my_dict = {"王力宏": {
    "部门": "科技部", "工资": 3000, "级别": 1
}, "周杰伦": {
    "部门": "市场部", "工资": 5000, "级别": 2
} , "林俊杰": {
    "部门": "市场部", "工资": 7000, "级别": 3
},"张学友": {
    "部门": "科技部", "工资": 4000, "级别": 1
},"刘德华": {
    "部门": "市场部", "工资": 6000, "级别": 2
}}

print(f"全体员工的信息如下：{my_dict}")

# for循环
for key in my_dict:
    if my_dict[key]["级别"] == 1:
        my_dict[key]["级别"] += 1
        my_dict[key]["工资"] += 1000

print(f"全体员工级别为1的员工完成升职加薪操作，操作后：{my_dict}")

































